In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import scipy.stats as st
import numpy as np
import scipy.stats as st
from scipy.stats import linregress
from scipy import stats

air_data_path = "airquality.csv"
air_data = pd.read_csv(air_data_path)
air_data.head()

,Unnamed: 0,Unnamed: 1,NO2 Mean,O3 Mean,SO2 Mean,CO Mean
0,NaN,NaN,mean,mean,mean,mean
1,State,Year,NaN,NaN,NaN,NaN
2,Alabama,2013,12.065634967741929,0.012098838709677423,0.750311306451613,0.2110068870967743
3,Alabama,2014,9.411745809286877,0.02466014925373136,1.1865171293532364,0.20592147014925288
4,Alabama,2015,9.07858020666667,0.023999966666666726,1.0094290199999982,0.2210266799999999

In [2]:
air_data = air_data.rename(columns = {"Unnamed: 0":"State", "Unnamed: 1": "Year"})
air_data.head()

,State,Year,NO2 Mean,O3 Mean,SO2 Mean,CO Mean
0,NaN,NaN,mean,mean,mean,mean
1,State,Year,NaN,NaN,NaN,NaN
2,Alabama,2013,12.065634967741929,0.012098838709677423,0.750311306451613,0.2110068870967743
3,Alabama,2014,9.411745809286877,0.02466014925373136,1.1865171293532364,0.20592147014925288
4,Alabama,2015,9.07858020666667,0.023999966666666726,1.0094290199999982,0.2210266799999999

In [3]:
air_data = air_data.drop(air_data.index[[0,1]])
air_data.head()

,State,Year,NO2 Mean,O3 Mean,SO2 Mean,CO Mean
2,Alabama,2013,12.065634967741929,0.012098838709677423,0.750311306451613,0.2110068870967743
3,Alabama,2014,9.411745809286877,0.02466014925373136,1.1865171293532364,0.20592147014925288
4,Alabama,2015,9.07858020666667,0.023999966666666726,1.0094290199999982,0.2210266799999999
5,Alabama,2016,9.524873194630876,0.02834774496644293,0.8351175503355704,0.20951413758389284
6,Alaska,2014,11.658509608938544,0.010306575418994405,5.951531268156425,0.4554438687150833

In [4]:
air_data.to_csv("cleaned_air.csv")